Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/мДатыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мДатыДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмОснование</name>
    <comment>Промежуточный</comment>
    <type>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.мВнесениеДатыРешения</types>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.мАктирование</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.мВзаимозачет</types>
      <types>DocumentRef.мПродлениеСроков</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
     Если Количество() = 0 Тогда
        // Удаление
        Если ЭтотОбъект.Отбор.ВидДатыДоговора.Значение = Справочники.мВидыДатДоговоров.ДатаПодписанияЗаказчиком Тогда
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
            
            НаборЗаписей.Отбор.Период.Установить(ЭтотОбъект.Отбор.Период.Значение);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
            НаборЗаписей.Отбор.Основание.Установить(ЭтотОбъект.Отбор.Основание);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ЭтотОбъект.Отбор.ЭтапДоговора);
            
            НаборЗаписей.Записать(Истина);
            
        ИначеЕсли ЭтотОбъект.Отбор.ВидДатыДоговора.Значение = Справочники.мВидыДатДоговоров.ДатаПродления Тогда
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
            
            НаборЗаписей.Отбор.Период.Установить(ЭтотОбъект.Отбор.Период.Значение);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
            НаборЗаписей.Отбор.Основание.Установить(ЭтотОбъект.Отбор.Основание);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ЭтотОбъект.Отбор.ЭтапДоговора);
            
            НаборЗаписей.Записать(Истина);    
        КонецЕсли;
    КонецЕсли; 
    
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры
